//“очность до 10^(-16)
//We have: fix point number and float point
//fix point save точность при +,-,(*,/) - but нужно избегать overflow
//„ем меньше число до точки, тем большую точность мы можем дать части после точки, так как при понижении
//степени мантисы уменьшаетс€ шаг точности, значит между нашими числами возникает возможность сохранить более
//точное число https://www.youtube.com/watch?v=2KTrsLcLODI&t=1226s
//≈сть зарегистрированые состо€ни€ байт NaN (Not a Number) - sNun и qNun, +inf, -inf, +0, -0
// —тандарт IEEE-754 (2008)

//Double или float - double

//–€д “ейлора

//»нтегрирование

//ƒвоичный поиск